In [2]:
import numpy as np
import pandas as pd

In [3]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [4]:
x = [1, 3, 5, np.nan, 6, 8]
x

[1, 3, 5, nan, 6, 8]

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame({
        'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
        'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
        'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})
df

        one       two     three
a  0.195838  1.107755       NaN
b -0.263759 -0.556724  1.707212
c -0.863648  0.885289 -1.015299
d       NaN  0.793808 -0.186178

In [7]:
df2 = df.copy()
df2

        one       two     three
a  0.195838  1.107755       NaN
b -0.263759 -0.556724  1.707212
c -0.863648  0.885289 -1.015299
d       NaN  0.793808 -0.186178

In [8]:
df.gt(df2)

     one    two  three
a  False  False  False
b  False  False  False
c  False  False  False
d  False  False  False

In [9]:
df.ne(df2)

     one    two  three
a  False  False   True
b  False  False  False
c  False  False  False
d   True  False  False

In [17]:
df['three'][1] == df2['three'][1]
df['three'][0] == df2['three'][0]

False

In [22]:
(0<df).all()

one      False
two      False
three    False
dtype: bool

In [23]:
(df > 0).any()

one      True
two      True
three    True
dtype: bool

In [24]:
(df > 0).any().any()

True

In [28]:
pd.Series([True]).bool()
pd.Series([False]).bool()
pd.DataFrame([[True]]).bool()
pd.DataFrame([[False]]).bool()

False

In [29]:
pd.Series(['foo', 'bar', 'baz']) == 'foo'

0     True
1    False
2    False
dtype: bool

In [30]:
pd.Series(['foo', 'bar', 'baz']) == pd.Index(['foo', 'bar', 'qux'])

0     True
1     True
2    False
dtype: bool

In [36]:
print(pd.Index(['foo', 'bar', 'qux'])[0])
print(pd.Series(['foo', 'bar', 'baz'])[0])

foo
foo

In [37]:
# Lengths must equal
pd.Series(['foo', 'bar', 'baz']) == pd.Series(['foo', 'bar'])

ValueError: Can only compare identically-labeled Series objects

In [38]:
(df + df == df * 2).all()

one      False
two       True
three    False
dtype: bool

In [39]:
df + df == df * 2

     one   two  three
a   True  True  False
b   True  True   True
c   True  True   True
d  False  True   True

In [40]:
np.nan == np.nan

False

In [43]:
z= [1,2,3,4,np.nan]
z

[1, 2, 3, 4, nan]

In [44]:
# (df).equals(df2) treas Nan as equal
(df + df).equals(df * 2)

True

In [45]:
df.mean(0)

one     -0.310523
two      0.557532
three    0.168578
dtype: float64

In [46]:
df.mean(1)

a    0.651797
b    0.295576
c   -0.331219
d    0.303815
dtype: float64

In [47]:
df

        one       two     three
a  0.195838  1.107755       NaN
b -0.263759 -0.556724  1.707212
c -0.863648  0.885289 -1.015299
d       NaN  0.793808 -0.186178

In [48]:
ts_stand = (df - df.mean()) / df.std()
ts_stand

        one       two     three
a  0.953081  0.729308       NaN
b  0.088019 -1.476921  1.102572
c -1.041100  0.434434 -0.848357
d       NaN  0.313179 -0.254215

In [49]:
ts_stand.std()

one      1.0
two      1.0
three    1.0
dtype: float64

In [55]:
series = pd.Series(np.random.randn(1000))
series

0     -0.429248
1      1.463443
2     -0.922164
3     -0.731154
4     -1.022930
         ...
995    1.152730
996    1.319210
997    0.604373
998    1.887942
999   -0.625462
Length: 1000, dtype: float64

In [56]:
# [::x] every xth element
series[::2] = np.nan
series

0           NaN
1      1.463443
2           NaN
3     -0.731154
4           NaN
         ...
995    1.152730
996         NaN
997    0.604373
998         NaN
999   -0.625462
Length: 1000, dtype: float64

In [57]:
series.describe()

count    500.000000
mean       0.004378
std        0.967134
min       -2.973047
25%       -0.650241
50%        0.051924
75%        0.629706
max        3.158227
dtype: float64

In [72]:
frame = pd.DataFrame(np.random.randn(1000, 5), columns=['a', 'b', 'c', 'd', 'e'])
frame

            a         b         c         d         e
0    1.163474  0.350749 -1.015008  0.827915 -1.017667
1    3.452869  0.419309 -1.952295  0.566044  0.688575
2    1.903166  1.340829  0.972173 -0.026380  0.692693
3   -0.485989 -0.101715 -0.470353  0.349331  0.088889
4    1.070064  0.392063  2.169286 -0.365954  0.206839
..        ...       ...       ...       ...       ...
995 -1.640244  1.209248 -1.352434 -0.386331  0.897369
996 -0.513257  0.939795  0.902617  1.260394  1.985597
997 -0.627361 -0.497374  0.817554  1.703222  1.025149
998  1.056511 -0.467261 -1.544839  1.266741  0.146882
999  1.384992 -0.167195 -0.809235 -0.945461  0.215522

[1000 rows x 5 columns]

In [74]:
frame.iloc[::2] = np.nan
#frame[::2] = np.nan
frame

            a         b         c         d         e
0         NaN       NaN       NaN       NaN       NaN
1    3.452869  0.419309 -1.952295  0.566044  0.688575
2         NaN       NaN       NaN       NaN       NaN
3   -0.485989 -0.101715 -0.470353  0.349331  0.088889
4         NaN       NaN       NaN       NaN       NaN
..        ...       ...       ...       ...       ...
995 -1.640244  1.209248 -1.352434 -0.386331  0.897369
996       NaN       NaN       NaN       NaN       NaN
997 -0.627361 -0.497374  0.817554  1.703222  1.025149
998       NaN       NaN       NaN       NaN       NaN
999  1.384992 -0.167195 -0.809235 -0.945461  0.215522

[1000 rows x 5 columns]

In [75]:
frame.describe()

                a           b           c           d           e
count  500.000000  500.000000  500.000000  500.000000  500.000000
mean     0.035411    0.036319   -0.056518   -0.039000   -0.008145
std      0.989432    0.995893    1.031172    1.013272    1.042834
min     -3.705477   -3.164251   -2.983078   -3.062113   -3.518052
25%     -0.599931   -0.583537   -0.722317   -0.731520   -0.723529
50%      0.008000    0.088524   -0.014726   -0.070475    0.042871
75%      0.714913    0.620106    0.644047    0.655987    0.745571
max      3.603606    3.848544    3.371924    3.182894    2.818571

In [76]:
s = pd.Series(['a', 'a', 'b', 'b', 'a', 'a', np.nan, 'c', 'd', 'a'])
s.describe()

count     9
unique    4
top       a
freq      5
dtype: object

In [77]:
s1 = pd.Series(np.random.randn(5))
s1

0   -0.566082
1   -1.761440
2   -0.894675
3    0.281532
4   -0.761683
dtype: float64

In [78]:
s1.idxmin(), s1.idxmax()

(1, 3)

In [79]:
df1 = pd.DataFrame(np.random.randn(5, 3), columns=['A', 'B', 'C'])
df1

          A         B         C
0 -0.404102  1.225246 -0.864632
1  1.996208  1.296484  0.727327
2  1.897008  0.893849 -0.120779
3 -0.359315 -0.364684 -1.624753
4 -0.989836  1.030227  0.415493

In [80]:
df1.idxmin(axis=0)

A    4
B    3
C    3
dtype: int64

In [81]:
df1.idxmax(axis=1)

0    B
1    A
2    A
3    A
4    B
dtype: object

In [82]:
df = pd.DataFrame({'col1': np.random.randn(3),'col2': np.random.randn(3)}, index=['a', 'b', 'c'])
df

       col1      col2
a  0.913891  1.161501
b -0.438186 -1.365204
c -0.877566  0.207257

In [84]:
for col in df:
    print(col)

col2
col2

In [85]:
df = pd.DataFrame({'a': [1, 2, 3], 'b': ['a', 'b', 'c']})
df

   a  b
0  1  a
1  2  b
2  3  c

In [88]:
for label, ser in df.items():
    print(label)
    print(ser)

a
0    1
1    2
2    3
Name: a, dtype: int64
b
0    a
1    b
2    c
Name: b, dtype: object

In [89]:
for row_index, row in df.iterrows():
    print(row_index, row, sep='\n')

0
a    1
b    a
Name: 0, dtype: object
1
a    2
b    b
Name: 1, dtype: object
2
a    3
b    c
Name: 2, dtype: object

In [92]:
for row in df.itertuples():
    print(row)

Pandas(Index=0, a=1, b='a')
Pandas(Index=1, a=2, b='b')
Pandas(Index=2, a=3, b='c')